In [28]:
import pandas as pd
import numpy as np

b1 = pd.read_csv('basic1.csv')
b1.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [29]:
#age 상위 20개 데이터로 뽑기
b1 = b1.sort_values(by =['age'],ascending=False).iloc[:20]
b1.head()

      id    age city    f1  f2   f3    f4         f5
96  id97  100.0   경기   NaN   0  NaN  INFP  67.886373
36  id37  100.0   부산   NaN   0  NaN  ESTP  33.308999
44  id45   97.0   대구  88.0   0  NaN  ENFJ  13.049921
51  id52   97.0   대구  82.0   1  NaN  ISFJ  90.496999
91  id92   97.0   경기  78.0   1  NaN  INFP  97.381034

In [30]:
b1.shape

(20, 8)

In [31]:
#f1의 결측치를 중앙값으로 채우기
b1.isnull().sum()

id       0
age      0
city     0
f1       8
f2       0
f3      20
f4       0
f5       0
dtype: int64

In [32]:
b1['f1'] = b1['f1'].fillna(b1['f1'].median())
b1.isnull().sum()

id       0
age      0
city     0
f1       0
f2       0
f3      20
f4       0
f5       0
dtype: int64

In [33]:
b1.head()

      id    age city    f1  f2   f3    f4         f5
96  id97  100.0   경기  77.5   0  NaN  INFP  67.886373
36  id37  100.0   부산  77.5   0  NaN  ESTP  33.308999
44  id45   97.0   대구  88.0   0  NaN  ENFJ  13.049921
51  id52   97.0   대구  82.0   1  NaN  ISFJ  90.496999
91  id92   97.0   경기  78.0   1  NaN  INFP  97.381034

In [34]:
#f4가 ISFJ이고 f5가 20 이상인
#f1의 평균값

a = b1[(b1['f4']=='ISFJ')&(b1['f5']>=20)]
a = pd.DataFrame(a)
print(a['f1'].mean())

73.875